// --створити масив з:
// - з 5 числових значень
// - з 5 стічкових значень
// - з 5 значень стрічкового, числового та булевого типу
// - та вивести його в консоль
// let arr =
//     [1, 2, 3, 4, 5, "one", "two", "three", "four", "five",
//         ["one-one", 11, true],
//         ["two-two", 22, false],
//         ["three-three", 33, false],
//         ["four-four", 44, true],
//         ["five-five", 55, true]
//     ];
// console.log(arr);

// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль
// let arr = [];
// arr[1] = "hihaha";
// arr[0] = 23;
// arr[100] = "dog";
// arr[arr.length - 40] = "hello";
//
// delete arr[0];
//
// console.log(arr)

// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
// for (let i = 0; i < 10; i++) {
// document.write("<div><p>hello world</p></div>");
// }

// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
// for (let i = 0; i <10; i++) {
//     document.write(`<div><p>I am ${i}th</p></div>`)
// }

// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
// let i = 0;
// while (i < 20) {
//     document.write(`<div><h1> hello </h1></div>`)
// }

// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.
// let i = 0;
// while (i < 20) {
//     i++;
//     document.write(`<div><h1> hello ${i} </h1></div>`)
// }

// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
// let arrOfUsers = [
//     {
//         id: 1,
//         name: "Leanne Graham",
//         username: "Bret",
//         email: "Sincere@april.biz"
//     },
//     {
//         id: 2,
//         name: "Ervin Howell",
//         username: "Antonette",
//         email: "Shanna@melissa.tv"
//     },
//     {
//         id: 3,
//         name: "Clementine Bauch",
//         username: "Samantha",
//         email: "Nathan@yesenia.net"
//     },
//     {
//         id: 4,
//         name: "Patricia Lebsack",
//         username: "Karianne",
//         email: "Julianne.OConner@kory.org"
//     },
//     {
//         id: 5,
//         name: "Chelsey Dietrich",
//         username: "Kamren",
//         email: "Lucio_Hettinger@annie.ca"
//     },
//     {
//         id: 6,
//         name: "Mrs. Dennis Schulist",
//         username: "Leopoldo_Corkery",
//         email: "Karley_Dach@jasper.info"
//     },
//     {
//         id: 7,
//         name: "Kurtis Weissnat",
//         username: "Elwyn.Skiles",
//         email: "Telly.Hoeger@billy.biz"
//     },
//     {
//         id: 8,
//         name: "Nicholas Runolfsdottir V",
//         username: "Maxime_Nienow",
//         email: "Sherwood@rosamond.me"
//     },
//     {
//         id: 9,
//         name: "Glenna Reichert",
//         username: "Delphine",
//         email: "Chaim_McDermott@dana.io"
//     },
//     {
//         id: 10,
//         name: "Clementina DuBuque",
//         username: "Moriah.Stanton",
//         email: "Rey.Padberg@karina.biz"
//     }
// ];
// for (const user of arrOfUsers) {
//     console.log(user);
// }

// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
// let strArr = ["hello", "world", "london", "is", "the", "of", "Great"];
// for (let i = 0; i < strArr.length; i++) {
//     console.log(strArr[i]);
// }

// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
// let randArr = [1, true, "kapral", false, null, "hello", true, undefined];
// for (let i = 0; i < randArr.length; i++) {
//     console.log(randArr[i]);
// }

// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
// let numAndStrArr = [1, true, 5, 2, false, true, true, 3, 6, 1, false, true, false];
// for (const el of numAndStrArr) {
//     if (typeof el === "boolean") {
//         console.log(el);
//     }
// }

// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
// let StrNumBool = [1, 2, 3, 4, "One", "Two", "Three", "Four", true, false];
// for (let i = 0; i < StrNumBool.length; i++) {
//     if (typeof StrNumBool[i] === "number") {
//         console.log(StrNumBool[i]);
//     }
// }

// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
// let StrNumBool = [1, 2, 3, 4, "One", "Two", "Three", "Four", true, false];
// for (let i = 0; i < StrNumBool.length; i++) {
//     if (typeof StrNumBool[i] !== "number") {
//         console.log(StrNumBool[i]);
//     }
// }

// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
// let arr = [];
// arr[1] = null;
// arr[2] = undefined;
// arr[3] = "number";
// arr[4] = 34;
// arr[5] = true;
// arr[6] = 11;
// arr[7] = 76;
// arr[8] = false;
// arr[9] = "null";
// arr[10] = "hello";
// for (let i = 0; i < arr.length; i++) {
//     console.log(arr[i]);
// }

// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// for (let i = 0; i < 10; i++) {
//     console.log(i);
// }

// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// for (let i = 0; i < 100; i++) {
//     console.log(i);
//     document.writeln(i.toString());
// }

// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
// for (let i = 0; i < 100; i += 2) {
//     console.log(i);
//     document.writeln(i.toString());
// }

// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// for (let i = 0; i < 100; i++) {
//     if ((i % 2) - 1) {
//         console.log(i);
//         document.writeln(i.toString())
//     }
// }

// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
// for (let i = 0; i < 100; i++) {
//     if (i % 2) {
//         console.log(i);
//         document.writeln(i.toString())
//     }
// }

// - Відтворити роботу годинника, відрахувавши 2 хвилини (2 цикли! 1й - хвилини, 2й - секунди)
// for (let i = 2; i >= 0; i--) {
//     for (let s = 59; s >= 0; s--) {
//         console.log(i + ":" + s);
//         document.writeln(i + ":" + s);
//     }
// }

// - Відтворити роботу годинника, відрахувавши  2 години 20 хвилини (3 цикли! 1й - години, 2й - хвилини, 3й - секунди)
// for (let i = 2; i >= 0; i--) {
//     for (let j = 19; j >= 0; j--) {
//         for (let k = 60; k >= 0; k--) {
//             console.log(i + ":" + j + ":" + k);
//         }
//     }
// }


// ______________________________________________________________________________________________________________________________________________________
// РОБОТА В АУДИТОРІЇ
// ______________________________________________________________________________________________________________________________________________________


// - Дан масив ['a', 'b', 'c']. Додайте йому в кінець елементи 1, 2, 3 за допомогою циклу.
// let arr = ['a', 'b', 'c'];
// for (let i = 1; i <= 3; i++) {
//     arr.push(i);
// }
//     console.log(arr);

// - Дан масив [1, 2, 3]. Зробіть з нього новий масив [3, 2, 1].
// - Дан масив [1, 2, 3]. Додайте йому в кінець елементи 4, 5, 6.

// let arr = [1, 2, 3];
// for (let i = 4; i < 7; i++) {
// for (let i = arr.length + 1; i < 7; i++) {
//     arr.push(i);
// }
//     console.log(arr)

// - Дан масив [1, 2, 3]. Додайте йому в початок елементи 4, 5, 6.
// - Дан масив ['js', 'css', 'jq']. Виведіть на екран перший елемент за допомогою shift()
// - Дан масив ['js', 'css', 'jq']. Виведіть на екран останній елемент за допомогою pop()
// - Дан масив [1, 2, 3, 4, 5]. Перетворіть масив в [4, 5].
// - Дан масив [1, 2, 3, 4, 5]. Перетворіть масив в [1,2].
// - Дан масив [1, 2, 3, 4, 5]. Зробіть з нього масив [1, 2, 3, 'a', 'b', 'c', 4, 5].
//     Підказка. Необхідно стерти елементи, зберегти їх кудись. Дописати букви і після букв повернути стерті цифри
// - Дан масив [1, 2, 3, 4, 5]. Зробіть з нього масив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].
//     Підказка. Працюйте по принципу задачі вище.
// - Взяти масив з 10 чисел або створити його. Вивести в консоль тільки ті елементи, значення яких є парними.
// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу та push () скопіювати значення одного масиву в інший
// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу скопіювати значення одного масиву в інший.
//
//
// ============
//
// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
//     1. перебрати його циклом while
//     2. перебрати його циклом for
//     3. перебрати циклом while та вивести  числа тільки з непарним індексом
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// 5. перебрати циклом while та вивести  числа тільки парні  значення
// 6. перебрати циклом for та вивести  числа тільки парні  значення
// 7. замінити кожне число кратне 3 на слово "okten"
// 8. вивести масив в зворотньому порядку.
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
// 10
// створити пустий масив та :
//     - заповнити його 50 парними числами за допомоги циклу.
// - заповнити його 50 непарними числами за допомоги циклу.
//
//
// 1. Створити пустий масив та :
//     a. заповнити його 50 парними числами за допомоги циклу.
//     b. заповнити його 50 непарними числами за допомоги циклу.
//     c. Заповнити масив 20ма рандомними числами. (Google: Generate random number JS)
// d. Заповнити масив 20ма рандомними чисалами в діапазоні від 8 до 732 (Google: Generate random number JS)
// 2. Вивести за допомогою console.log кожен третій елемен
// 3. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним.
// 4. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним та записати їх в новий масив
// 5. Вивести кожен елемент масиву, сусід справа якого є парним
// EXAMPLE: [ 1, 2, 3, 5, 7, 9, 56, 8, 67 ] -> Має бути виведено 1, 9, 56
// 6. Є масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. Обрахувати середній чек.
//
// 7. Створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.
// 8. Створити масив з будь якими значеннями (стрінги, числа, і тд...). пройтись по ньому, і якщо елемент є числом - додати його в інший масив.
//
//
//
//
//     ______________________________________________________________________________________________________________________________________________________
// Додатково
// ______________________________________________________________________________________________________________________________________________________
//
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу while зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.