// - Створити змінні. Присвоїти кожному з них значення: 'hello','owu','com', 'ua', 1, 10, -999, 123, 3.14, 2.7, 16, true, false.
//     Вивести кожну змінну за допомогою: console.log , alert, document.write
// let w1 = "hello";
// console.log(w1);
// alert(w1);
// document.write(w1);
// let w2 = "owu";
// console.log(w2);
// alert(w2);
// document.write(w2);
// let w3 = "com";
// console.log(w3);
// alert(w3);
// document.write(w3);
// let w4 = " ua";
// console.log(w4);
// alert(w4);
// document.write(w4);
// let n1 = 1;
// console.log(n1);
// alert(n1);
// document.write(n1);
// let n2 = 10;
// console.log(n2);
// alert(n2);
// document.write(n2);
// let n3 = -999;
// console.log(n3);
// alert(n3);
// document.write(n3);
// let n4 = 123;
// console.log(n4);
// alert(n4);
// document.write(n4);
// let n5 = 3.14;
// console.log(n5);
// alert(n5);
// document.write(n5);
// let n6 = 2.7;
// console.log(n6);
// alert(n6);
// document.write(n6);
// let n7 = 16;
// console.log(n7);
// alert(n7);
// document.write(n7);
// let b1 = true;
// console.log(b1);
// alert(b1);
// document.write(b1.toString());
// let b2 = false;
// console.log(b2);
// alert(b2);
// document.write(b2.toString());

// - Переприсвоїти кожну змінну з завдання вище на будь які довільні значення.
// w1 = "hey";
// w2 = "okten";
// w3 = "ua";
// w4 = "com";
// n1 = 1;
// n2 = 2;
// n3 = 3;
// n4 = 4;
// n5 = 5;
// n6 = 6;
// n7 = 7;
// n8 = 8;
// b1 = false;
// b2 = true;

//     Вивести кожну змінну за допомогою: console.log , alert, document.write
// - За допомогою 3х різних prompt() отримати 3 слова які являються вашими Імям, По-Батькові та роками.
//     Вивести "Вітаю *Імя* *По батькові*. Тобі *вік* років".

// - Взяти змінні з завдання вище та зєднати їх в одну змінну (конкатинація).

// - За допомогою prompt() отримати 3 числа. Привести їх до числа (Google "String to number JS"). Вивести їх в консоль.
// let num1 = +prompt("Enter first number.");
// let num2 = +prompt("Enter second number.");
// let num3 = +prompt("Enter third number.");
// console.log(num1);
// console.log(num2);
// console.log(num3);

// - За допомогою prompt() отримати 4 числа. Привести їх до числа за допомогою parseInt. Додати їх всі між собою і результат вивести в консоль.
// let num1 = prompt("Enter first number.");
// let num2 = prompt("Enter second number.");
// let num3 = prompt("Enter third number.");
// let num4 = prompt("Enter fourth number");
// let sum = parseInt(num1) + parseInt(num2) + parseInt(num3) + parseInt(num4);
// console.log(sum);

// - За допомогою prompt() отримати 3 числа з плаваючою точкою за допомогою parseFloat.
//     Просумувати їх. Отрманий результат записати в змінну result. Вивести цю змінну в консоль.
// let num1 = parseFloat(prompt("Enter first decimal number."));
// let num2 = parseFloat(prompt("Enter second decimal number."));
// let num3 = parseFloat(prompt("Enter third decimal number."));
// let result = num1 + num2 + num3;
// console.log(result);


// - За допомогою prompt() отримати 3 числа з плаваючою точкою. Заокруглити їх (Google "round number JS"). 
// Просумувати їх між собою. Результат вивести в консоль.
// let num1 = parseFloat(prompt("Enter first decimal number."));
// let num2 = parseFloat(prompt("Enter second decimal number."));
// let num3 = parseFloat(prompt("Enter third decimal number."));
// let result = Math.round(num1) + Math.round(num2) + Math.round(num3);
// console.log(result);

// - За допомогою prompt() отримати 2 цілих числа.
//     Перше число - це число яке будуть підносити до степеня. Друге число - це число яке являється степенню.
//     За допомогою Math.pow (Google) піднести перше число в степінь другого числа.
//     Example. Число 1 = 5. Число 2 = 2. Результат = 25
// let num1 = +prompt("Enter first number.");
// let num2 = +prompt("Enter second number.");
// let result = Math.pow(num1, num2);
// console.log(result);

// - За допомогою оператора typeof визначити типи наступних змінних та вивести їх в консоль.
// let a = 100;
// let b = '100';
// let c = true;
// console.log(typeof a);
// console.log(typeof b);
// console.log(typeof c);

// - Поставет відповідний оператор в виразах що б вийшов відповідний результат.
//     В однакових виразаї не використовувати однакові оператори!!!
// 5 < 6 -> true
// 5 > 6 -> false
// 5 === 6 -> false
// 5 >= 6 -> false
// 10 === 10 -> true
// 10 >= 10 -> true
// 10 < 10 -> false
// 10 > 10 -> false
// 10 !== 10 -> false
// 123 === '123' -> false
// 123 !=== '123' -> true
//
// Додатково:
//     - Подивіться на наступні вирази і спробуйте вгадати яким буде вивід в консоль. Перевірте себе.
// console.log(132 > 100 && 45 < 12 ); false
// console.log(34 > 33 && 23 < 90 ); false
// console.log(99 > 100 && 45 > 12 ); false
// console.log(132 > 100 || 45 < 12 ); true
// console.log(111 > 11 || 45 < 111 ); true
// console.log((111 > 11 || 45 < 111) && (132 > 100 || 45 < 12) ); true
// console.log((111 > 11 || 45 < 56) || (132 > 100 || 45 < 12) ); true
// console.log((132 > 100 && 45 < 12 ) && (132 > 100 || 45 < 12 ) ); false
// console.log((111 > 11 || 45 < 111) || (99 > 100 && 45 > 12 )); true
// console.log(!!'-1'); true
// console.log(!!-1); true
// console.log(!!'0'); true
// console.log(!!'null'); true
// console.log(!!'undefined'); true
// console.log(!!(3/'owu')); false
// console.log((111 > 11 || 45 < 111) ||  !!'0'); true
//
//
// ______________________________________________________________________________________________________________________________________________________
// РОБОТА В АУДИТОРІЇ
// ______________________________________________________________________________________________________________________________________________________

// 1. Оголосіть змінні str, num, flag и txt зі значеннями «Привіт», 123, true, «true».
// За допомогою typeof переконайтесь, що значення змінних належать типам: string, number и  boolean.
// let str = "привіт";
// console.log(typeof str);
// let num = 123;
// console.log(typeof num);
// let flag = true;
// console.log(typeof flag);
// let txt = "true";
// console.log(typeof txt);



// 2. Оголосіть змінні a1, a2, a3, a4, a5. За домогою 3х математичних оператцій отримайте числа:
//     34,
//         12,
//         66,
//         90,
//         87
// Старайтесь використовувати різні оператори.
//     Example: 88 = (16 / 2) * 11
//
// 3.  Створіть змінні a6, a7, a8, a9, a10. Запишіть в них результати виразів:
//     5 % 3,
//     3 % 5,
//     5 + '3',
//     '5' - 3,
//     75 + 'кг'
//
// 4. Напищіть код, який вираховує площу прямокутника висотою 23см. (змінна height) та шириною 10см (змінна width).
// Значееня площі зберігати в змінній s.
//
// 5.  Напиши код, который находит объем цилиндра высотой 10м (переменная heightC) и диаметром основания 4м (dC),
//     результат поместите в переменную v.
//
// 6. У прямоугольного треугольника две стороны n (со значением 3) и m (со значением 4).
// Найдите гипотенузу k по теореме Пифагора (нужно использовать функцию Math.pow(число, степень) или оператор возведения в степень ** ).
//
// 7. Напишите скрипт, который выводит "Hello world", создавши переменную str и выводить спомощью document.write, alert и console.log
//
// 8. Вывести в окно браузера при помощи метода alert() следующие данные: Ваше ФИО, возраст, хобби (каждой на новой строки спомощью \n).
//
// 9. Создать 4 переменные с использованием ключевого слова let с именами str1, str2, str3, concatenation.
//     Переменной str1 присвоить фразу ‘Кто ‘, str2 – ‘ты ‘, str3 – ‘такой?’
//   Локальной переменной concatenation присвоить результат конкатенации 3-х строк: str1, str2, str3.
//     Вывести в документ содержимое переменной concatenation спомощью document.write
//
// 10. Какие значения выведет в окно браузера следующий фрагмент кода?  и почему?
//     let str = "20";
// let a = 5;
// document.write(str + a + "<br/>");
// document.write(str - a + "<br/>");
// document.write(str * "2" + "<br/>");
// document.write(str / 2 + "<br/>");
// 11. Какие значения выведет в окно консоли следующий фрагмент кода если его поместить в console.log?
//     parseInt("3.14")
//     parseInt("-7.875")
// parseInt("435")
// parseInt("Вася")
//
// 12.  С помощью окна ввода, вызываемого методом prompt, пользователь может ввести данные, которые будут использоваться далее, повторите код ниже
// let str = prompt("Enter something", "ho-ho")
// console.log(str);
//
// 13. С помощью окна ввода, вызываемого методом prompt, сделать сложение двух чисел, а вывод результата при помощи метода alert
// 14. С помощью окна ввода, вызываемого методом prompt, пользователь последовательно выводит имя, фамилию и возраст, а вам не обходимо вывести строку такого вида
// Доброго вечера Иван Иванов, мои поздравления что вам 32 , а вывод результата при помощи метода alert
//
//
//
// =====================
// ======ДОП============
// =====================
//
//
//
//
// 1. Три різних числа вводяться через prompt().
//     За допомоги if else вивести іх в порядку зростання. (відсортувати по зростанню)
//
// 2.
// Все параматры получаем с клавиатуры!!!!
//     Имитируем поведение пешехода на перекстке.
//     Если светофор зеленый - вывести "иди".
//     Если светофор желтый - вывести "подожди".
//     Если светофор красный - вывести "стой".
//     Если светофор в аварийном режиме вывести "делай что хочешь"!
//
//     3
// Все параметры получаем с клавиатуры!!!!(prompt , confirm)
// Создать переменную isRoadClear которая характеризирует наличие на дороге машин.
//     Улучшаем предыдущее задание.
//     Если светофор зеленый и машин нет - вывести "иди".
//     Если светофор зеленый и машины есть  - вывести подожди пока нарушители проедут".
// Если светофор желтый и машины есть - вывести "жди".
//     Если светофор желтый и машин нет - вывести "все рано жди".
//     Если светофор красный и машин нет- вывести "стой все рано".
//     Если светофор красный - и машины есть вывести "стой и жди".
//     Если светофор в аварийном режиме вывести "делай что хочешь"!